routes/web.php

Route::get('/user',function(){
    return "chao user";
});
Route::get('/data',function(){
    $productlines= App\Models\Productline::all();

    foreach ($productlines as $productline ) {
        echo "<pre>";
        echo $productline->products;
        echo "</pre>";

        // foreach ($productline as) {
        //     # code...
        // }
    }
});
---
select * from `products` where `products`.`product_line` = 1 and `products`.`product_line` is not null
select * from `productlines`