app/Http/Controllers/ProductController.php

select * from `products`
---
    public function index()
    {
        //
        $products= Product::all();

insert into `products` (`product_name`, `products_codes`, `product_line`, `product_scale`, `quanitily_inStock`, `product_vendor`, `product_description`, `buy_price`, `MSRP`, `updated_at`, `created_at`) values ('sadsa', '1', '1', '1', '21', 'ddasdas', 'dsadasdas', '12', 'dasdas', '2020-06-29 01:59:47', '2020-06-29 01:59:47')
---
    public function store(Request $request)
    {
        //
        $product = new Product();
        $product->product_name = $request->product_name;
        $product->products_codes = $request->products_codes;
        $product->product_line = $request->product_line;
        $product->product_scale = $request->product_scale;
        $product->quanitily_inStock = $request->quanitily_inStock;
        $product->product_vendor = $request->product_vendor;
        $product->product_description = $request->product_description;
        $product->buy_price = $request->buy_price;
        $product->MSRP = $request->MSRP;

        $product->save();

select * from `products` where `products`.`id` = '4' limit 1
---
    public function edit($id)
    {
        //
        $product=Product::findOrFail($id);

select * from `products` where `products`.`id` = '4' limit 1
---
    public function update(Request $request, $id)
    {
        //
        $product = Product::findOrFail($id);