app/Http/Controllers/UserController.php

select * from `users`
---
public function form(){
    $user= User::all();

select * from `users` where `users`.`id` = 'index' limit 1
---
 public function show($id)
    {
        $user = User::find($id);